app/controllers/services_controller.rb

  def new
    @service = Service.new(service_params)
    @service.save
---
INSERT INTO "services" ("ccs_service_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["ccs_service_id", "ronak"], ["created_at", "2019-10-10 12:52:30.789830"], ["updated_at", "2019-10-10 12:52:30.789830"]]

  def update
    remove_extra_value_from_hash(request.params,params[:service][:ccs_service_id])
    respond_to do |format|
      if @service.update(service_params)
---
UPDATE "services" SET "ccs_service_id" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["ccs_service_id", "2ronak"], ["updated_at", "2019-10-10 08:37:48.044654"], ["id", 35]]

  def destroy
    @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 51]]